- 1. Create a Data Frame with the names of students and their grades in three subjects (mathematics, physics, literature).
- 2. From the created DataFrame, select the grades of all students in the subject "mathematics".
- 3. Find all students who have a physics score > 6.
- 4. Add a new column that will contain the average score of each student in all subjects.
- 5. Delete all rows from the DataFrame with data about students who have an average score below 50.
- 6. Output the average age of the students.
- 7. Bring out students who have a math score above 5.
- 8. Add a new total column containing the sum of all the grades of each student.
- 9. Withdraw students living in Moscow.
- 10. Sort the DataFrame by math score in descending order.
- 11. Bring out the student with the highest grade in physics.
- 12. Output the average grade in literature among students under the age of 16.
- 13. Create a new Data Frame containing only the names and cities of the students.
- 14. Output the number of students from each city.
- 15. Swap math and physics grades for all students.
- 16. Bring out students who have an average grade in all subjects above 6.
- 17. Create a Data Frame that will contain only students with grades in biology and art above 7.
- 18. Print the names of all students and their grades in mathematics, physics and literature.
- 19. Count the number of students under the age of 16.
- 20. Bring out students who have a history score above 6.
- 21. Add an average column that will contain the average of each student's grades in all subjects.
- 22. To withdraw students from the cities of Moscow and Berlin
- 23. Find a student with a minimum grade in literature and print his name and city.
- 24. Print the names of the students and their average grades in the subjects, sorted in descending order of the average value.
- 25. Create a new Data Frame containing only the names and grades of students in mathematics, physics, and literature who have a physics score above 5.
- 26. Bring out students who have all grades above 3.
- 27. Add a new pass_fail column, which will contain the value Pass if all the student's grades are above 4, and Fail otherwise.

In [126]:
import pandas as pd

In [127]:
t = {
    "name": ["Ivan", "Evelina", "Peter", "Georgii", "Maxim", "Asen"],
    "city": ["Moscow", "Burgas", "Plovdiv", "Sofia", "Berlin", "Burgas"],
    "mathematics": [6, 7, 1, 3, 9, 5],
    "physics": [2, 5, 8, 9, 6, 4],
    "literature": [3, 6, 7, 8, 4, 2],
    "age": [16, 15, 16, 15, 16, 17],
    "history": [4, 8, 5, 9, 7, 8],
    "biology": [7, 5, 8, 6, 9, 4],
    "art": [6, 9, 7, 8, 7, 8]
}

d = pd.DataFrame(t)

print(d)

      name     city  mathematics  physics  literature  age  history  biology  \
0     Ivan   Moscow            6        2           3   16        4        7
1  Evelina   Burgas            7        5           6   15        8        5
2    Peter  Plovdiv            1        8           7   16        5        8
3  Georgii    Sofia            3        9           8   15        9        6
4    Maxim   Berlin            9        6           4   16        7        9
5     Asen   Burgas            5        4           2   17        8        4

   art
0    6
1    9
2    7
3    8
4    7
5    8

In [128]:
print(d["mathematics"])

0    6
1    7
2    1
3    3
4    9
5    5
Name: mathematics, dtype: int64

In [129]:
s = d[d["physics"] > 6]
print(s)

      name     city  mathematics  physics  literature  age  history  biology  \
2    Peter  Plovdiv            1        8           7   16        5        8
3  Georgii    Sofia            3        9           8   15        9        6

   art
2    7
3    8

In [130]:
d["average"] = (d["mathematics"] + d["physics"] + d["literature"] + d["history"] + d["biology"] + d["art"]) / 6
print(d)

      name     city  mathematics  physics  literature  age  history  biology  \
0     Ivan   Moscow            6        2           3   16        4        7
1  Evelina   Burgas            7        5           6   15        8        5
2    Peter  Plovdiv            1        8           7   16        5        8
3  Georgii    Sofia            3        9           8   15        9        6
4    Maxim   Berlin            9        6           4   16        7        9
5     Asen   Burgas            5        4           2   17        8        4

   art  average score
0    6       3.666667
1    9       6.000000
2    7       5.333333
3    8       6.666667
4    7       6.333333
5    8       3.666667

In [131]:
d["average mathematics"] = sum(d["mathematics"]) / len(d["mathematics"])
print(d)

      name     city  mathematics  physics  literature  age  history  biology  \
0     Ivan   Moscow            6        2           3   16        4        7
1  Evelina   Burgas            7        5           6   15        8        5
2    Peter  Plovdiv            1        8           7   16        5        8
3  Georgii    Sofia            3        9           8   15        9        6
4    Maxim   Berlin            9        6           4   16        7        9
5     Asen   Burgas            5        4           2   17        8        4

   art  average score  average mathematics
0    6       3.666667             5.166667
1    9       6.000000             5.166667
2    7       5.333333             5.166667
3    8       6.666667             5.166667
4    7       6.333333             5.166667
5    8       3.666667             5.166667

In [132]:
t = d.loc[d["physics"] < 8]
print(t)

      name    city  mathematics  physics  literature  age  history  biology  \
0     Ivan  Moscow            6        2           3   16        4        7
1  Evelina  Burgas            7        5           6   15        8        5
4    Maxim  Berlin            9        6           4   16        7        9
5     Asen  Burgas            5        4           2   17        8        4

   art  average score  average mathematics
0    6       3.666667             5.166667
1    9       6.000000             5.166667
4    7       6.333333             5.166667
5    8       3.666667             5.166667

In [133]:
d["age"].mean()

15.833333333333334

In [134]:
d[d["city"] == "Moscow"]

,name,city,mathematics,physics,literature,age,history,biology,art,average score,average mathematics
0,Ivan,Moscow,6,2,3,16,4,7,6,3.666667,5.166667

In [135]:
d["total"] = d["mathematics"] + d["physics"] + d["literature"] + d["history"] + d["biology"] + d["art"]
d

,name,city,mathematics,physics,literature,age,history,biology,art,average score,average mathematics,total
0,Ivan,Moscow,6,2,3,16,4,7,6,3.666667,5.166667,28
1,Evelina,Burgas,7,5,6,15,8,5,9,6.000000,5.166667,40
2,Peter,Plovdiv,1,8,7,16,5,8,7,5.333333,5.166667,36
3,Georgii,Sofia,3,9,8,15,9,6,8,6.666667,5.166667,43
4,Maxim,Berlin,9,6,4,16,7,9,7,6.333333,5.166667,42
5,Asen,Burgas,5,4,2,17,8,4,8,3.666667,5.166667,31

In [136]:
d["mathematics"].sort_values(ascending=True)

2    1
3    3
5    5
0    6
1    7
4    9
Name: mathematics, dtype: int64

In [137]:
# или d.loc[d["physics"].idxmax()] 
d[d["physics"] == max(d["physics"])]

,name,city,mathematics,physics,literature,age,history,biology,art,average score,average mathematics,total
3,Georgii,Sofia,3,9,8,15,9,6,8,6.666667,5.166667,43

In [138]:
d[d["age"] < 16]["literature"].mean()

7.0

In [139]:
new_d = d[["name", "city"]]
new_d

      name     city
0     Ivan   Moscow
1  Evelina   Burgas
2    Peter  Plovdiv
3  Georgii    Sofia
4    Maxim   Berlin
5     Asen   Burgas

In [140]:
d["city"].value_counts()

city
Burgas     2
Moscow     1
Plovdiv    1
Sofia      1
Berlin     1
Name: count, dtype: int64

In [141]:
d["mathematics"], d["physics"] = d["physics"], d["mathematics"]

d

,name,city,mathematics,physics,literature,age,history,biology,art,average score,average mathematics,total
0,Ivan,Moscow,2,6,3,16,4,7,6,3.666667,5.166667,28
1,Evelina,Burgas,5,7,6,15,8,5,9,6.000000,5.166667,40
2,Peter,Plovdiv,8,1,7,16,5,8,7,5.333333,5.166667,36
3,Georgii,Sofia,9,3,8,15,9,6,8,6.666667,5.166667,43
4,Maxim,Berlin,6,9,4,16,7,9,7,6.333333,5.166667,42
5,Asen,Burgas,4,5,2,17,8,4,8,3.666667,5.166667,31

In [142]:
d[d["average score"] > 6]

,name,city,mathematics,physics,literature,age,history,biology,art,average score,average mathematics,total
3,Georgii,Sofia,9,3,8,15,9,6,8,6.666667,5.166667,43
4,Maxim,Berlin,6,9,4,16,7,9,7,6.333333,5.166667,42

In [143]:
r = d[(d["biology"] > 6) & (d["art"] > 6)]
r

,name,city,mathematics,physics,literature,age,history,biology,art,average score,average mathematics,total
2,Peter,Plovdiv,8,1,7,16,5,8,7,5.333333,5.166667,36
4,Maxim,Berlin,6,9,4,16,7,9,7,6.333333,5.166667,42

In [144]:
d[["name", "mathematics", "literature", "physics"]]

      name  mathematics  literature  physics
0     Ivan            2           3        6
1  Evelina            5           6        7
2    Peter            8           7        1
3  Georgii            9           8        3
4    Maxim            6           4        9
5     Asen            4           2        5

In [145]:
len(d[d["age"] < 16])

2

In [146]:
d[d["history"] > 6]

,name,city,mathematics,physics,literature,age,history,biology,art,average score,average mathematics,total
1,Evelina,Burgas,5,7,6,15,8,5,9,6.000000,5.166667,40
3,Georgii,Sofia,9,3,8,15,9,6,8,6.666667,5.166667,43
4,Maxim,Berlin,6,9,4,16,7,9,7,6.333333,5.166667,42
5,Asen,Burgas,4,5,2,17,8,4,8,3.666667,5.166667,31

,name,city,mathematics,physics,literature,age,history,biology,art,average score,average mathematics,total,average
0,Ivan,Moscow,2,6,3,16,4,7,6,3.666667,5.166667,28,4.666667
1,Evelina,Burgas,5,7,6,15,8,5,9,6.000000,5.166667,40,6.666667
2,Peter,Plovdiv,8,1,7,16,5,8,7,5.333333,5.166667,36,6.000000
3,Georgii,Sofia,9,3,8,15,9,6,8,6.666667,5.166667,43,7.166667
4,Maxim,Berlin,6,9,4,16,7,9,7,6.333333,5.166667,42,7.000000
5,Asen,Burgas,4,5,2,17,8,4,8,3.666667,5.166667,31,5.166667

In [151]:
d[(d["city"] == "Moscow") | (d["city"] == "Burgas")]

,name,city,mathematics,physics,literature,age,history,biology,art,average score,average mathematics,total,average
0,Ivan,Moscow,2,6,3,16,4,7,6,3.666667,5.166667,28,4.666667
1,Evelina,Burgas,5,7,6,15,8,5,9,6.000000,5.166667,40,6.666667
5,Asen,Burgas,4,5,2,17,8,4,8,3.666667,5.166667,31,5.166667

In [166]:
d.loc[d["literature"] == min(d["literature"]), ["name", "city"]]

   name    city
5  Asen  Burgas

In [176]:
d[["name", "average"]].sort_values(by=["average"], ascending=False)

      name   average
3  Georgii  7.166667
4    Maxim  7.000000
1  Evelina  6.666667
2    Peter  6.000000
5     Asen  5.166667
0     Ivan  4.666667

In [179]:
n = d.loc[d["physics"] > 6, ["name", "mathematics", "physics", "literature"]]
n

      name  mathematics  physics  literature
1  Evelina            5        7           6
4    Maxim            6        9           4

In [197]:
d[(d["mathematics"] > 3) & (d["physics"] > 3) & (d["literature"] > 3) & (d["history"] > 3) & (d["biology"] > 3) & (d["art"] > 3)]

,name,city,mathematics,physics,literature,age,history,biology,art,average score,average mathematics,total,average
1,Evelina,Burgas,5,7,6,15,8,5,9,6.000000,5.166667,40,6.666667
4,Maxim,Berlin,6,9,4,16,7,9,7,6.333333,5.166667,42,7.000000

In [204]:
def check_pass_fail(row):
    if (row["mathematics"] > 4) & (row["art"] > 4):
        return "Pass"
    else:
        return "Fail"

d["pass_fail"] = d.apply(check_pass_fail, axis=1)
d

,name,city,mathematics,physics,literature,age,history,biology,art,average score,average mathematics,total,average,pass_fail
0,Ivan,Moscow,2,6,3,16,4,7,6,3.666667,5.166667,28,4.666667,Fail
1,Evelina,Burgas,5,7,6,15,8,5,9,6.000000,5.166667,40,6.666667,Pass
2,Peter,Plovdiv,8,1,7,16,5,8,7,5.333333,5.166667,36,6.000000,Pass
3,Georgii,Sofia,9,3,8,15,9,6,8,6.666667,5.166667,43,7.166667,Pass
4,Maxim,Berlin,6,9,4,16,7,9,7,6.333333,5.166667,42,7.000000,Pass
5,Asen,Burgas,4,5,2,17,8,4,8,3.666667,5.166667,31,5.166667,Fail